fio/sdj_log_1G/fio_randread_08k.log
test: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=3248: Thu Jul 12 10:40:54 2018
   read: IOPS=515, BW=4125KiB/s (4224kB/s)(1024MiB/254186msec)
    slat (nsec): min=1518, max=55029, avg=14883.59, stdev=5333.03
    clat (usec): min=741, max=1241.4k, avg=124092.95, stdev=92504.41
     lat (usec): min=745, max=1241.4k, avg=124108.33, stdev=92504.62
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   26], 10.00th=[   37], 20.00th=[   55],
     | 30.00th=[   71], 40.00th=[   87], 50.00th=[  103], 60.00th=[  120],
     | 70.00th=[  140], 80.00th=[  176], 90.00th=[  239], 95.00th=[  305],
     | 99.00th=[  464], 99.50th=[  542], 99.90th=[  701], 99.95th=[  760],
     | 99.99th=[  902]
   bw (  KiB/s): min=  720, max=10944, per=99.91%, avg=4121.28, stdev=763.11, samples=508
   iops        : min=   90, max= 1368, avg=515.15, stdev=95.39, samples=508
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=0.45%, 20=2.34%, 50=14.22%
  lat (msec)   : 100=31.58%, 250=42.58%, 500=8.08%, 750=0.65%, 1000=0.06%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.73%, sys=1.62%, ctx=128315, majf=0, minf=159
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=131072,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=4125KiB/s (4224kB/s), 4125KiB/s-4125KiB/s (4224kB/s-4224kB/s), io=1024MiB (1074MB), run=254186-254186msec

Disk stats (read/write):
  sdj: ios=128958/0, merge=2043/0, ticks=16116533/0, in_queue=16118479, util=100.00%